In [11]:
import numpy as np
import pandas as pd

In [12]:
a = np.array([[1,6],
              [2,8],
              [3,11],
              [3,10],
              [1,7]])
print (a)

[[ 1  6]
 [ 2  8]
 [ 3 11]
 [ 3 10]
 [ 1  7]]

In [13]:
mean_a = a.mean (axis=0)
print (mean_a)

[2.  8.4]

In [14]:
a_centered = np.hstack(((a[0:,:1]-mean_a[0]),(a[0:,1:]-mean_a[1])))
print (a_centered)

[[-1.  -2.4]
 [ 0.  -0.4]
 [ 1.   2.6]
 [ 1.   1.6]
 [-1.  -1.4]]

Задания по Датафреймам (сделал 3 из 4)

In [31]:
authors = {"author_id": [1, 2, 3], "author_name": ["Тургенев", "Чехов", "Островский"]}
authors = pd.DataFrame(authors)
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [32]:
books = {"author_id": [1, 1, 1, 2, 2, 3, 3],
        "book_title": ["Отцы и дети", "Рудин", "Дворянское гнездо", "Толстый и тонкий", "Дама с собачкой", "Гроза", 
                       "Таланты и поклонники"],
        "price":[450, 300, 350, 500, 450, 370, 290]}
books = pd.DataFrame(books)
books

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

In [38]:
authors_price = pd.merge(authors, books, on='author_id', how='outer')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [41]:
top5 = authors_price.nlargest(5, "price")
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

Далее 4-е задание по датафремам, которое не сделал, но долго возился!!!!!!!!!!!!!!!!

In [56]:
groupby["price"].mean()

author_name
Островский    330.000000
Тургенев      366.666667
Чехов         475.000000
Name: price, dtype: float64

In [111]:
gas = authors_price.groupby("author_name")
print (gas)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000020C959E4048>

In [61]:
groupby.agg({"price": "min", "author_id": "count"})

             price  author_id
author_name
Островский     290          2
Тургенев       300          3
Чехов          450          2

In [63]:
authors_stat = {"author_name": [],
        "min_price": [],
        "max_price":[],
        "mean_price":[]
               }
authors_stat = pd.DataFrame(authors_stat)
authors_stat

Empty DataFrame
Columns: [author_name, min_price, max_price, mean_price]
Index: []

In [75]:
authors_price.query('(price > 0) & (author_id > 0)')
authors_price.query('(price > 0) & (author_id == 1)')

   author_id author_name         book_title  price
0          1    Тургенев        Отцы и дети    450
1          1    Тургенев              Рудин    300
2          1    Тургенев  Дворянское гнездо    350

In [109]:
z = groupby["price"].mean()
z = pd.DataFrame(z)
print (z)

authors_stat = {"author_name":[],
        "min_price":[],
        "max_price":[],
        "mean_price":groupby["price"].mean()
               }
authors_stat = pd.DataFrame(authors_stat)
authors_stat

                  price
author_name
Островский   330.000000
Тургенев     366.666667
Чехов        475.000000

ValueError: array length 0 does not match index length 3

In [95]:
groupby["price"].max()

author_name
Островский    370
Тургенев      450
Чехов         500
Name: price, dtype: int64

In [96]:
groupby["price"].min()

author_name
Островский    290
Тургенев      300
Чехов         450
Name: price, dtype: int64